### Starter code for Project 4. 
#### Run these cells before starting the assignment.

#### 1. create BQ dataset:

In [1]:
%env dataset_id=school_enrollments

env: dataset_id=school_enrollments

In [2]:
!bq --location=US mk --dataset $dataset_id

BigQuery error in mk operation: Dataset 'fine-entry-397522:school_enrollments'
already exists.

#### 2. create and populate BQ tables:

In [3]:
import os

In [4]:
gsutil_cmd = "gsutil ls gs://cs327e-open-access/stanford-school-enrollment/*"
file_listings = os.popen(gsutil_cmd)
dataset="school_enrollments"

for file in file_listings:

    start_index = file.rindex("_") + 1
    end_index = file.rindex(".")
    table = file[start_index:end_index]
    
    if table in ("co", "district", "fl", "ga", "id", "ma", "mo", "ne", "ny", "or", "school", "sd", "wi"):
        print("skipping " + table)
        continue

    bq_cmd = "bq --location=US load --autodetect --skip_leading_rows=1 "\
             "--source_format=CSV " + dataset + "." + table + ' ' + file
    print(bq_cmd)
    
    os.system(bq_cmd)

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ak gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ak.csv

Waiting on bqjob_r601bc3bb6c98a9a6_0000018ae3ba2e28_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ar gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ar.csv

Waiting on bqjob_r367ed05fe0f3ebfb_0000018ae3ba40c3_1 ... (5s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.az gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_az.csv

Waiting on bqjob_r6102ab53b8dd7482_0000018ae3ba6052_1 ... (5s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ca gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ca.csv

Waiting on bqjob_r6e4da2ca9c0c5596_0000018ae3ba7fee_1 ... (9s) Current status: DONE

skipping co
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ct gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ct.csv

Waiting on bqjob_r649df99a20ee2b10_0000018ae3baafb1_1 ... (3s) Current status: DONE

skipping district
skipping fl
skipping ga
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.hi gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_hi.csv

Waiting on bqjob_r4c26e46d91a2a029_0000018ae3bac6bd_1 ... (2s) Current status: DONE

skipping id
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.in gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_in.csv

Waiting on bqjob_r3c337a538338a2c4_0000018ae3bad958_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.la gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_la.csv

Waiting on bqjob_r5bb1c1a00dd6fabb_0000018ae3baf473_1 ... (3s) Current status: DONE

skipping ma
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.md gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_md.csv

Waiting on bqjob_r270c698f1233352a_0000018ae3bb0b88_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.mn gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_mn.csv

Waiting on bqjob_r67e3723c6e7b01a9_0000018ae3bb1e67_1 ... (5s) Current status: DONE

skipping mo
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ms gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ms.csv

Waiting on bqjob_r7984f72ee2be578_0000018ae3bb3dd9_1 ... (2s) Current status: DONE

skipping ne
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nh gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nh.csv

Waiting on bqjob_r7b77859c050026af_0000018ae3bb5059_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nj gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nj.csv

Waiting on bqjob_r3664ba72fae7eab2_0000018ae3bb638b_1 ... (1s) Current status: DONE

BigQuery error in load operation: Error processing job 'fine-
entry-397522:bqjob_r3664ba72fae7eab2_0000018ae3bb638b_1': Error while reading
data, error message: Could not parse 'N' as INT64 for field
ccd_district_high_grade (position 12) starting at location 2800632  with message
'Unable to parse' File: gs://cs327e-open-access/stanford-school-
enrollment/zf406jp4427_nj.csv
Failure details:
- Error while reading data, error message: CSV processing encountered
too many errors, giving up. Rows: 12208; errors: 1; max bad: 0;
error percent: 0
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nm gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nm.csv

Waiting on bqjob_r3f1dc1a4268e8632_0000018ae3bb726d_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nv gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_nv.csv

Waiting on bqjob_r4bd58e672ab281f6_0000018ae3bb850a_1 ... (5s) Current status: DONE

skipping ny
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ok gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ok.csv

Waiting on bqjob_r5b422107f580fd9b_0000018ae3bba45c_1 ... (3s) Current status: DONE

skipping or
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.pa gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_pa.csv

Waiting on bqjob_r1085b0896ac6f7dc_0000018ae3bbbb58_1 ... (5s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.sc gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_sc.csv

Waiting on bqjob_r4ae393b4f41452ef_0000018ae3bbda6c_1 ... (3s) Current status: DONE

skipping school
skipping sd
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.tx gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_tx.csv

Waiting on bqjob_r70b56bf8fd4be632_0000018ae3bbf11c_1 ... (5s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ut gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_ut.csv

Waiting on bqjob_r573128a008ec45f0_0000018ae3bc0ff3_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wa gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_wa.csv

Waiting on bqjob_r4f4e33ee21fab0a2_0000018ae3bc22e8_1 ... (5s) Current status: DONE

skipping wi
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wy gs://cs327e-open-access/stanford-school-enrollment/zf406jp4427_wy.csv

Waiting on bqjob_r3602dc1d98052646_0000018ae3bc41d7_1 ... (2s) Current status: DONE

#### 3. Find school enrollments by school name, grade level, and year for Texas

In [5]:
!bq show --schema=true $dataset_id.tx

[{"name":"state","type":"STRING","mode":"NULLABLE"},{"name":"county","type":"STRING","mode":"NULLABLE"},{"name":"county_state_id","type":"STRING","mode":"NULLABLE"},{"name":"admin_level","type":"STRING","mode":"NULLABLE"},{"name":"district_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_type","type":"STRING","mode":"NULLABLE"},{"name":"district","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"school_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"school_state_id","type":"FLOAT","mode":"NULLABLE"},{"name":"school","type":"STRING","mode":"NULLABLE"},{"name":"school_state_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter_school","type":"BOOLEAN","mode":"NULLABLE"},{"name":"ccd_school_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"year","type":"INTEGER","mode":"NULLABLE"},{"name":"term","type":"STRING","mode":"NULLABLE"},{"name":"grade","type":"STRING","mode":"NULLABLE"},{"name":"white","type":"STRING","mode":"NULLABLE"},{"name":"black","type":"STRING","mode":"NULLABLE"},{"name":"hispanic","type":"STRING","mode":"NULLABLE"},{"name":"native_american","type":"STRING","mode":"NULLABLE"},{"name":"native_american_alaskan_native","type":"STRING","mode":"NULLABLE"},{"name":"asian","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian","type":"STRING","mode":"NULLABLE"},{"name":"asian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"multiracial","type":"STRING","mode":"NULLABLE"},{"name":"unknown_race","type":"STRING","mode":"NULLABLE"},{"name":"male","type":"STRING","mode":"NULLABLE"},{"name":"female","type":"STRING","mode":"NULLABLE"},{"name":"non_binary","type":"STRING","mode":"NULLABLE"},{"name":"unknown_gender","type":"STRING","mode":"NULLABLE"},{"name":"ell","type":"STRING","mode":"NULLABLE"},{"name":"ell_percent","type":"STRING","mode":"NULLABLE"},{"name":"homeless","type":"STRING","mode":"NULLABLE"},{"name":"homeless_percent","type":"STRING","mode":"NULLABLE"},{"name":"low_income","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced_percent","type":"STRING","mode":"NULLABLE"},{"name":"disability","type":"STRING","mode":"NULLABLE"},{"name":"section_504","type":"STRING","mode":"NULLABLE"},{"name":"total","type":"STRING","mode":"NULLABLE"}]

#### Note: STRING type for "total" column

In [6]:
%%bigquery
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query is running:   0%|          |

Downloading:   0%|          |

         school             grade  year  total
0     AKINS H S          grade_10  2020   7920
1     AKINS H S          grade_10  2021   8217
2     AKINS H S          grade_11  2020   7304
3     AKINS H S          grade_11  2021   7293
4     AKINS H S          grade_12  2020   6699
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    759
1735  ZILKER EL      kindergarten  2020    847
1736  ZILKER EL      kindergarten  2021    693
1737  ZILKER EL  pre_kindergarten  2020    330
1738  ZILKER EL  pre_kindergarten  2021    143

[1739 rows x 4 columns]

##### Documentation on BQ's string functions: https://cloud.google.com/bigquery/docs/reference/standard-sql/string_functions

In [7]:
!bq --location=US mk --dataset "views"

BigQuery error in mk operation: Dataset 'fine-entry-397522:views' already
exists.

In [8]:
%%bigquery
create view views.austin_enrollments_by_school_grade_year as
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Executing query with job ID: d86d5036-c048-4bcc-b04c-4613b09d898b
Query executing: 0.30s

ERROR:
 409 Already Exists: Table fine-entry-397522:views.austin_enrollments_by_school_grade_year

Location: US
Job ID: d86d5036-c048-4bcc-b04c-4613b09d898b

In [9]:
%%bigquery
select * from views.austin_enrollments_by_school_grade_year

Query is running:   0%|          |

Downloading:   0%|          |

         school             grade  year  total
0     AKINS H S          grade_10  2020   7920
1     AKINS H S          grade_10  2021   8217
2     AKINS H S          grade_11  2020   7304
3     AKINS H S          grade_11  2021   7293
4     AKINS H S          grade_12  2020   6699
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    759
1735  ZILKER EL      kindergarten  2020    847
1736  ZILKER EL      kindergarten  2021    693
1737  ZILKER EL  pre_kindergarten  2020    330
1738  ZILKER EL  pre_kindergarten  2021    143

[1739 rows x 4 columns]

#### 4. Open Looker Studio and create a chart from this view:
##### https://lookerstudio.google.com/

#### Project 4 homework marker. Start homework from here.

In [10]:
#Prevents python related in syntax errors
from google.cloud import bigquery
clitent = bigquery.Client()

#### 1) I'm selecting district names and calculating the average enrollments for both males and females. To obtain this data, I'm utilizing the 'ca' table from the 'school_enrollments' dataset. I'm specifically interested in the year 2020, so I've applied a filter to consider only this year and also to exclude certain grade types like total K-12 enrollments and combined kindergarten records. To get a clearer view, I'm grouping all the results by the district name. I want to ensure that the districts I'm looking at have significant numbers, so I'm only considering those where both male and female averages are over 100 students. To make sense of the data, I'm sorting the results based on the average male enrollment. Lastly, to avoid being overwhelmed with too much data, I'm limiting my output to just the top 10 records.

In [11]:
%%bigquery
SELECT district, avg(male) as avg_male, avg(female) as avg_female
FROM school_enrollments.ca
WHERE year = 2020 AND (grade != 'k_12_total' and grade != 'combined_K')
GROUP BY district
HAVING avg_male > 100 and avg_female > 100
ORDER BY avg_male 
LIMIT 10;

Query is running:   0%|          |

Downloading:   0%|          |

                     district    avg_male  avg_female
0            Maricopa Unified  100.574074  104.518519
1           Dehesa Elementary  101.952381  100.833333
2           Oxnard Union High  105.607143  103.690476
3         Whittier Union High  106.037037  101.166667
4           Modesto City High  109.979167  106.638889
5          Anaheim Union High  116.617424  109.242424
6  Fullerton Joint Union High  117.983333  108.958333
7          Fremont Union High  119.010417  111.229167
8  Antelope Valley Union High  119.927083  114.942708
9                   Kern High  129.243827  125.672840

#### 2) In this query, I'm focusing on individual schools within districts to understand the count of Hispanic students. I'm selecting the district and school names from the 'ak' table within the 'school_enrollments' dataset. To get the count of Hispanic students in each school, I'm summing up the 'hispanic' column. I'm keen on looking at specific grade data, so I've excluded records where the grade is either the total K-12 count or the combined pre-K to 12th grade count. Once the data is grouped by district and school, I ensure that the results include only those records where the count of Hispanic students is known (not NULL). For better readability and comparison, I'm sorting the results by district, followed by school, and then by the count of Hispanic students in descending order. Lastly, I only want a glimpse of the data, so I'm limiting my output to the top 10 records.

In [12]:
%%bigquery
SELECT district, school, sum(hispanic) Hispanic_count 
FROM school_enrollments.ak 
WHERE grade != "k_12_total" or grade != "pk_12_total"
GROUP BY district, school 
HAVING Hispanic_count is not NULL 
ORDER BY district, school, Hispanic_count DESC
LIMIT 10;

Query is running:   0%|          |

Downloading:   0%|          |

                         district                  school  Hispanic_count
0          Alaska Gateway Schools                                    78.0
1          Alaska Gateway Schools    Alaska REACH Academy            78.0
2         Aleutian Region Schools                                   507.0
3         Aleutian Region Schools             Adak School           507.0
4  Aleutians East Borough Schools                                   195.0
5  Aleutians East Borough Schools        King Cove School            39.0
6  Aleutians East Borough Schools       Sand Point School           156.0
7               Anchorage Schools                                399451.0
8               Anchorage Schools            AVAIL School           312.0
9               Anchorage Schools  Abbott Loop Elementary          2197.0

#### 3) In this query, I'm examining the average enrollments of different racial demographics within schools from the 'ca' table of the 'school_enrollments' dataset for the year 2020. I'm specifically filtering out general enrollments like total K-12 and combined kindergarten. My focus is on schools where the average number of Black students is higher than that of White, Asian, and Hispanic students. I've organized the results to showcase schools with the highest Black enrollments first, followed by descending averages of Hispanic, White, and Asian students. For brevity, I'm limiting the results to the top 10 schools.

In [13]:
%%bigquery
SELECT school, AVG(black) as avg_black , AVG(white) as avg_white, AVG(asian) as avg_asian, AVG(hispanic) as avg_hispanic
FROM school_enrollments.ca
WHERE year = 2020
AND (grade != 'k_12_total' and grade != 'combined_K')
GROUP BY school 
HAVING avg_black > avg_white and avg_black > avg_asian and avg_black > avg_hispanic
ORDER BY avg_black DESC, avg_hispanic DESC, avg_white DESC, avg_asian DESC
LIMIT 10;

Query is running:   0%|          |

Downloading:   0%|          |

,school,avg_black,avg_white,avg_asian,avg_hispanic
0,Fortune,66.416667,1.166667,2.666667,24.250000
1,WESM Health/Sports Medicine,50.416667,2.333333,1.083333,12.583333
2,Oakland Technical High,43.916667,39.916667,33.750000,31.083333
3,ICEF View Park Preparatory High,38.166667,0.000000,0.000000,1.916667
4,"Crenshaw Science, Technology, Engineering, Mat...",36.416667,0.416667,0.000000,19.083333
5,Susan Miller Dorsey Senior High,34.000000,1.000000,0.083333,31.500000
6,La Tijera K-8 Charter School Academy of Excell...,32.750000,0.083333,0.166667,24.250000
7,Windsor Hills Math Science,31.000000,0.166667,0.000000,3.416667
8,Orville Wright Engineering and Design Magnet,30.666667,1.583333,1.333333,15.333333
9,Ambler Avenue Elementary,29.416667,0.416667,0.583333,6.000000

#### 4) In this query, I'm delving into the 'tx' table from the 'school_enrollments' dataset to explore the average male enrollment within districts for the year 2020. To ensure accurate calculations, I'm converting the 'male' column values to floating-point numbers. After grouping the results by district, I'm specifically interested in those where the average male enrollment exceeds 500. To make the data insightful, I'm sorting districts with the highest average male enrollments at the top, and I'm capping my results to the top 10 districts for a concise overview.

In [14]:
%%bigquery
SELECT district, 
       AVG(SAFE_CAST(male AS FLOAT64)) as avg_male_enrollment
FROM school_enrollments.tx
WHERE year = 2020
GROUP BY district
HAVING avg_male_enrollment > 500
ORDER BY avg_male_enrollment DESC
LIMIT 10;

Query is running:   0%|          |

Downloading:   0%|          |

                    district  avg_male_enrollment
0      CYPRESS-FAIRBANKS ISD          1399.953488
1             HALLSVILLE ISD          1351.000000
2                   KATY ISD          1281.820896
3  TRINITY BASIN PREPARATORY          1239.333333
4                  KLEIN ISD          1157.812500
5                 CONROE ISD          1126.711864
6                  ALIEF ISD          1076.409091
7                PROSPER ISD          1069.500000
8            LAKE TRAVIS ISD          1054.545455
9          MINERAL WELLS ISD          1037.666667

#### 5) In this query, I'm computing the average Hispanic enrollment as a fraction for two states: New Mexico and Nevada, using their respective tables within the 'school_enrollments' dataset. I'm safely converting the 'hispanic' values to floating-point for accuracy. From the computed averages, I'm selecting states with Hispanic enrollments greater than 50%. The results are then sorted in descending order based on the average Hispanic enrollment.

In [15]:
%%bigquery
WITH StateHispanicAvg AS (
    SELECT 'nm' as state, AVG(SAFE_CAST(hispanic AS FLOAT64)) as avg_hispanic FROM school_enrollments.nm UNION ALL
    SELECT 'nv' as state, AVG(SAFE_CAST(hispanic AS FLOAT64)) as avg_hispanic FROM school_enrollments.nv 
)
SELECT state, avg_hispanic
FROM StateHispanicAvg
WHERE avg_hispanic > 0.5
ORDER BY avg_hispanic DESC;

Query is running:   0%|          |

Downloading:   0%|          |

  state  avg_hispanic
0    nm    199.982456
1    nv    157.490828

#### 6) In this query, I'm grouping all of the counties in the state of Washington together, and we are finding the average homelessness rate per county to get a feel of what counties might be of low income and face economic hardships. We exclude the total count 'pk_12_total' because this number skews real data since it's the total.

In [16]:
%%bigquery
SELECT county County, avg(homeless) Homeless_average
FROM school_enrollments.wa
WHERE grade != 'pk_12_total'
GROUP BY county
ORDER BY Homeless_average desc

Query is running:   0%|          |

Downloading:   0%|          |

          County  Homeless_average
0          Mason          5.525753
1         Yakima          4.961646
2          Clark          4.662744
3         Pierce          4.516443
4         Island          4.465517
5       Thurston          4.267271
6      Snohomish          4.134269
7        Cowlitz          4.094995
8        Spokane          4.072732
9           King          3.981338
10        Chelan          3.801825
11         Grant          3.754192
12  Grays Harbor          3.253128
13        Asotin          3.208909
14       Douglas          3.019157
15       Whatcom          2.990465
16        Skagit          2.987755
17      Franklin          2.909404
18     Wahkiakum          2.816327
19       Pacific          2.799291
20        Benton          2.784605
21         Lewis          2.749010
22  Pend Oreille          2.636364
23       Clallam          2.217962
24        Kitsap          2.088611
25   Walla Walla          2.027414
26      Okanogan          1.639553
27       Stevens          1.358343
28         Adams          1.152830
29      Skamania          0.975845
30     Klickitat          0.740967
31     Jefferson          0.712378
32      Kittitas          0.686474
33      San Juan          0.572973
34      Columbia          0.501548
35         Ferry          0.439701
36       Whitman          0.413474
37       Lincoln          0.213646
38      Garfield          0.051020

#### 7) In this query I am grouping the total number of students in a school with in a district and comaaring it to the amount of students who are on Free and Reduced Lunches

In [17]:
%%bigquery
#Used this query to make chart2.pdf
SELECT 
    district AS school_name,
    SUM(SAFE_CAST(free_and_reduced AS FLOAT64)) AS total_free_and_reduced_students,
    SUM(SAFE_CAST(total AS FLOAT64)) AS total_students,
    ROUND(
        COALESCE(
            IF(
                IS_NAN(
                    SAFE_DIVIDE(SUM(SAFE_CAST(free_and_reduced AS FLOAT64)), SUM(SAFE_CAST(total AS FLOAT64))) * 100
                ),
                0,
                SAFE_DIVIDE(SUM(SAFE_CAST(free_and_reduced AS FLOAT64)), SUM(SAFE_CAST(total AS FLOAT64))) * 100
            ),
            0
        )
    ) AS free_and_reduced_percentage
FROM
    school_enrollments.ca
WHERE 
    year = 2020
GROUP BY
    district
ORDER BY
    free_and_reduced_percentage DESC
LIMIT 25;

Query is running:   0%|          |

Downloading:   0%|          |

,school_name,total_free_and_reduced_students,total_students,free_and_reduced_percentage
0,California School for the Deaf-Fremont (State ...,4188.0,8400.0,50.0
1,California School for the Blind (State Special...,768.0,1536.0,50.0
2,SBE - Celerity Himalia,8232.0,17232.0,48.0
3,SBE - OnePurpose,1080.0,2400.0,45.0
4,SBE - Academia Avance Charter,3564.0,7872.0,45.0
5,Elkins Elementary,96.0,216.0,44.0
6,SBE - Prepa Tec Los Angeles High,3540.0,8160.0,43.0
7,SBE - Magnolia Science Academy Santa Ana,5472.0,13104.0,42.0
8,SBE - KIPP Bayview Elementary,1092.0,2616.0,42.0
9,SBE - Watsonville Prep,1644.0,4032.0,41.0
10,"Igo, Ono, Platina Union Elementary",348.0,840.0,41.0
11,SBE - Mary L. Booker Leadership Academy,552.0,1368.0,40.0
12,SBE - Baypoint Preparatory Academy,3624.0,8952.0,40.0
13,SBE - Rocketship Futuro Academy,5040.0,12792.0,39.0
14,SBE - Perseverance Preparatory,300.0,792.0,38.0
15,SBE - Olive Grove Charter - Lompoc,1248.0,3312.0,38.0
16,SBE - Vista Springs Charter,1896.0,5136.0,37.0
17,SBE - Latitude 37.8 High,900.0,2472.0,36.0
18,SBE - Sweetwater Secondary,2508.0,7176.0,35.0
19,SBE - Olive Grove Charter - Orcutt/Santa Maria,2160.0,6288.0,34.0
20,SBE - KIPP Navigate College Prep,1320.0,4008.0,33.0
21,SBE - Grossmont Secondary,2424.0,7608.0,32.0
22,SBE - Olive Grove Charter,144.0,456.0,32.0
23,SBE - Los Angeles College Prep Academy,876.0,2712.0,32.0
24,SBE - The School of Arts and Enterprise,5736.0,18168.0,32.0

#### 8) This query finds the total number of hispanic students in the state of Arizona and Indiana, sums the result and groups them by year showing the increase over the years.

In [ ]:
%%bigquery
SELECT indiana.year, (arizona.total_hispanics + indiana.total_hispanics) Arizona_and_Indiana_Hispanic_Count
FROM 
    (SELECT DISTINCT i.year, sum(i.hispanic) total_hispanics
    FROM school_enrollments.in i
    WHERE grade = 'pk_12_total' and school != '' and i.hispanic is not null
    GROUP BY i.year
    ORDER BY total_hispanics) indiana
INNER JOIN 
    (SELECT DISTINCT a.year, sum(a.hispanic) total_hispanics
    FROM school_enrollments.ar a
    WHERE grade = 'k_12_total' and school != '' and a.hispanic is not null
    GROUP BY a.year
    ORDER BY total_hispanics) arizona
ON indiana.year = arizona.year
ORDER BY year asc

#### 9) This query calculates the total number of students per grade in all of Washington and Wyoming seperately, and then joins the results to one table and then we calculate the sum at each grade to see what grades have the highest population count.

In [ ]:
%%bigquery
SELECT wash.grade Grade, wash.total Washington_total, wyo.total Wyoming_total, (wash.total+wyo.total) Total_students
FROM
  (SELECT grade, ifnull(sum(total),0) Total
  FROM school_enrollments.wa w
  GROUP BY grade
  HAVING (grade != 'pk_12_total') and (grade != 'adult' ) and (grade != 'kindergarten_half_day')) wash
FULL OUTER JOIN
  (SELECT grade, ifnull(sum(total),0) Total
  FROM school_enrollments.wy wy
  GROUP BY grade
  HAVING (grade != 'k_12_total') and (grade != 'adult' )) wyo
ON wash.grade = wyo.grade
WHERE wash.grade is not null and wyo.grade is not null
ORDER BY Total_students desc

#### 10) This query groups all of the grades in the data set in the state of California, and sums the number of Pacific Islanders per grade in the state.

In [ ]:
%%bigquery
SELECT 
    grade,sum(native_hawaiian_pacific_islander) Pacific_Islander_Students
FROM 
    school_enrollments.ca c
GROUP BY
    grade
Having 
    grade != 'combined_K' and grade != 'k_12_total'
ORDER BY 
    Pacific_Islander_Students DESC;